/* 信02 2250748 王渝鹮 */

/* 函数实现部分，{ }内的东西可以任意调整，目前的return 0只是一个示例，可改变 */

/* 不允许定义任何形式的外部全局、静态全局、宏定义、只读变量 */

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strlen(const char str[])
{
    int point = 0;
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; str[i] != '\0'; i++) {
        point = i+1;
    }
    return point; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strcat(char s1[], const char s2[])
{
   
    int point = 0;
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; s1[i] != '\0'; i++) {
        point = i;
    }
    for (int j = 0; s2[j] != '\0'; j++) {

        s1[++point] = s2[j];
        if (s2[j + 1] == '\0') {
            s1[++point] = '\0';
        }
       
    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strncat(char s1[], const char s2[], const int len)
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    int point = tj_strlen(s1);//原\0的最后位置
    for (int i = 0; i < len; i++) {
       
       
        if (s2[i] != '\0') {
            s1[point + i] = s2[i];
        }

        else {
            s1[point + i] = '\0';
            break;
        }

    }
    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strcpy(char s1[], const char s2[])
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; s2[i] != '\0'; i++) {
        s1[i] = s2[i];
        if (s2[i + 1] == '\0') {
            s1[i + 1] = '\0';
        }
    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strncpy(char s1[], const char s2[], const int len)
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; i < len; i++) {
        if (s2[i] != '\0') {
            s1[i] = s2[i];
            
        }
        else {
            break;
        }
    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strcmp(const char s1[], const char s2[])
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; ; i++) {
        if ((int)s1[i] == (int)s2[i]&& s1[i] != '\0') {
            continue;
        }
        else {
            return (int)s1[i] - (int)s2[i];
        }
    
    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strcasecmp(const char s1[], const char s2[])
{
    int point1 = 0;
    int point2 = 0;
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
   
    for (int i = 0; ; i++) {
        if (s1[i] >= 65 && s1[i] <= 90) {
            point1 = 32;

        }
        else {
            point1 = 0;
        }
        if (s2[i] >= 65 && s2[i] <= 90) {
            point2 = 32;
        }
        else {
            point2 = 0;
        }
        if ((int)s1[i]+point1 == (int)s2[i]+point2 && s1[i] != '\0') {
            continue;
        }
        else {
            return (int)s1[i]+point1 - (int)s2[i]-point2;
        }

    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strncmp(const char s1[], const char s2[], const int len)
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0;i<len ; i++) {
        if ((int)s1[i] == (int)s2[i] && s1[i] != '\0') {
            continue;
        }
        else {
            return (int)s1[i] - (int)s2[i];
        }

    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strcasencmp(const char s1[], const char s2[], const int len)
{
    int point1 = 0;
    int point2 = 0;
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; i < len; i++) {
        if (s1[i] >= 65 && s1[i] <= 90) {
            point1 = 32;

        }
        else {
            point1 = 0;
        }
        if (s2[i] >= 65 && s2[i] <= 90) {
            point2 = 32;
        }
        else {
            point2 = 0;
        }
        if ((int)s1[i] + point1 == (int)s2[i] + point2 && s1[i] != '\0') {
            continue;
        }
        else {
            return (int)s1[i] + point1 - (int)s2[i] - point2;
        }


    }


    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strupr(char str[])
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */

    for (int i = 0; i < tj_strlen(str); i++) {
        if (str[i] >= 'a' && str[i] <= 'z') {
            str[i] -= 32;
        }
    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strlwr(char str[])
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; i < tj_strlen(str); i++) {
        if (str[i] >= 'A' && str[i] <= 'Z') {
            str[i] += 32;
        }
    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strchr(const char str[], char ch)
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; i < tj_strlen(str); i++) {
        if (str[i] == ch) {
            return 1+ i;
        }
        if (i + 1 == tj_strlen(str)) {
            return 0;
        }
    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strstr(const char str[], const char substr[])
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; i < tj_strlen(str); i++) {
        if (str[i] == substr[0]) {
            if (tj_strncmp(&str[i], substr, tj_strlen(substr)) == 0) {
                return i + 1;
            }

        }
        if (i + 1 == tj_strlen(str)) {
            return 0;
        }
    }
   

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strrchr(const char str[], const char ch)
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */

    for (int i = tj_strlen(str)-1; i >= 0; i--) {
        if (str[i] == ch) {
            return i + 1;
        }
        if (i== 0) {
            return 0;
        }
    }

    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strrstr(const char str[], const char substr[])
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */

    for (int i = tj_strlen(str) - 1; i >= 0; i--) {
        if (str[i] == substr[0]) {
            if (tj_strncmp(&str[i], substr, tj_strlen(substr)) == 0) {
                return i + 1;
            }

        }
        if (i == tj_strlen(str)) {
            return 0;
        }
    }
    return 0; //return值可根据需要修改
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int tj_strrev(char str[])
{
    /* 注意：函数内不允许定义任何形式的数组（包括静态数组） */
    for (int i = 0; i < (tj_strlen(str) - 1)/2; i++) {
        char change = str[i];
        str[i] = str[tj_strlen(str) - 1 - i];
        str[tj_strlen(str) - 1 - i] = change;
    }
    return 0; //return值可根据需要修改
}
