/* 2250748 王渝鹮 信02 */
#include <iostream>
#include <iomanip>
#include<limits>
using namespace std;

#define N_POW	112		//幂的次数
#define N_NUM	N_POW+1	//十进制形式的小数位数

/***************************************************************************
  函数名称：
  功    能：输出某一行的幂次（某个一维数组的内容）
  输入参数：
  返 回 值：
  说    明：pormpt为非空串则输出串内容
				  为空串则输出“2^-xxx”，具体见demo
***************************************************************************/
void output(const char prompt[], const char d[])
{
	if (prompt == NULL) {

		cout << "2^" << setiosflags(ios::right) << setw(4) << (-1) * (int)d[0] << " : 0.";

		for (int i = 1; i < d[0] + 1; i++) {
			cout << d[i];
		}
		cout << endl;
		//字符串的输出，直接写数组名,但二维数组怎么输出单行？
		//其实不是怎么输出字符串的问题，还有就是demo中其实也不是输出一行的字符串，例如11行则输出到11格，
		//所以我现在考虑用循环来输出


	}
	else {
		cout << prompt;

		for (int i = 0; d[i] != 0; i++) {
			cout << d[i];
		}
		cout << endl;
	}
}

/***************************************************************************
  函数名称：
  功    能：用二维数组第i行的值，计算第i+1行
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
void calc_next(char d_cur[], char d_next[])//char类型的0-9怎么算？48-57，但其实可以全当int，输出时加0就行
{
	int point = 0;
	for (int i = 1; i < 113; i++) {
		d_next[i] = (d_cur[i] + point) / 2;
		if (d_cur[i] % 2 != 0) {
			point = 10;
		}
		else {
			point = 0;//必须重置。因为这句话卡了很久
		}
	}
}

/***************************************************************************
  函数名称：
  功    能：根据幂次表，计算某个二进制小数的十进制值
  输入参数：char pure_decimal[] : 存放二进制小数的数组
			char out[] ：存放计算得到的十进制小数
		   char power_table[][N_NUM + 1]：幂次表
  返 回 值：
  说    明：
 ***************************************************************************/
void calc_num(char pure_decimal[], char out[], char power_table[][N_NUM + 1])
{
	for (int i = 1; i < 113; i++) {//存放二进制小数的,ij从1开始是因为powertable方便看
		if (pure_decimal[i - 1] == '1') {
			for (int j = 1; j < 113; j++) {//out数组要初始化为0
				out[j - 1] = power_table[i][j] - '0' + out[j - 1];
			}
			for (int k = 111; k >= 0; k--) {//char数组改成int
				while (out[k] >= 10) {
					out[k] = out[k] - 10;
					out[k - 1] = out[k - 1] + 1;
				}
			}
		}
	}
}

/***************************************************************************
  函数名称：
  功    能：输入一个二进制纯小数
  输入参数：
  返 回 值：
  说    明：
 ***************************************************************************/
void input_pure_decimal(char pure_decimal[])//标记回车处，不然之后打印没办法知道打到哪
{
	cout << "请输入一个二进制纯小数，小数点开头，小数点后不超过112位(例：.101101)" << endl;
	cin >> pure_decimal[0];
	while (pure_decimal[0] != '.') {
		cout << "不是以.开头，请重输" << endl;
		cin.clear();
		cin.ignore(numeric_limits<streamsize>::max(), '\n');
		cin >> pure_decimal[0];
	}
	cin.getline(pure_decimal, 112);//缺省是回车结束

}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：is_upper ：1 - 上标尺
						 0 - 下标尺
  返 回 值：
  说    明：
***************************************************************************/
void output_rod(const bool is_upper)
{
	if (is_upper) { //上标尺
		cout << "-----------------------------------------------------------------------------------------------------------------------------------" << endl;
		cout << "----------- 上标尺  1         2         3         4         5         6         7         8         9         A         B         C" << endl;
		cout << "-----------123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890" << endl;
		cout << "-----------------------------------------------------------------------------------------------------------------------------------" << endl;
	}
	else {//下标尺
		cout << "-----------------------------------------------------------------------------------------------------------------------------------" << endl;
		cout << "-----------123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890" << endl;
		cout << "----------- 下标尺  1         2         3         4         5         6         7         8         9         A         B         C" << endl;
		cout << "-----------------------------------------------------------------------------------------------------------------------------------" << endl;
	}
}

/***************************************************************************
  函数名称：
  功    能：
  输入参数：
  返 回 值：
  说    明：
***************************************************************************/
int main()
{
	/* 说明：首先定义 power_table[113][114]，输出为全0，再进行初始化
	*
	*  1、第[0]行整个不用，[1]~[112] 与2^-1 ~ 2^-112 对应，因此需要113行
	*  2、第[0]列存放幂次，[1]~[112]列依次存放十分位、百分位、千分位、...  （2^-i次方的十进制小数，最多i位），[113]预留，用于某些特殊要求，比如\0
	*  2、每行的第0列存放幂次，[1]~开始存放十进制的每一位，从而达到高精度存放的目的
	*     例：        第[0]列  第[1]列  第[2]列  第[3]列  第[4]列 ...
	*		第[1]行   -1     5        0        0        0		//表示0.5
	*		第[2]行   -2     2        5        0        0		//表示0.25
	*		第[3]行   -3     1        2        5        0		//表示0.125
	*		第[4]行   -4     0        6        2        5		//表示0.0625
	*			...
	*		第[112]行 -112   ...
	*
	注：1、本二维数组的类型，既可以是int，也可以是char，因为计算时，每个元素的值都在0-9之间，用char足够了（char型输出时注意数字0-9和字符0-9的问题即可）
		2、因为如此，本题放在数组综合训练中，而没有放在字符数组中
	*/
	char power_table[N_POW + 1][N_NUM + 1] = { 0 }; //先全部初始化为0
	int i;

	/* 初始化，[0]里面存放幂次，初始化后的结果为：
	   行|列  [0]   [1]   [2]
	   [0]     0     0     0  //本行不用
	   [1]     -1    5     0  // 2^-1 初始化为0.5
	   [2]     -2    0     0
	   ...
	   [112]   -112  0     0
	*/
	for (i = 1; i <= N_POW; i++) {
		power_table[i][0] = i; //幂次 -1 ~ -52
	}
	power_table[1][1] = 5; // 2^-1 = 0.5，先置[1][1]为5
	//好坑人的cpp。。。char类型直接命名得5，怪不得一直卡。。但其实只要输出的时候分清就可以

	/* 循环方式计算幂表：
	   1、二维数组带一个下标，表示一个大小为114的一维数组
	   2、2^-1为已知的0.5，power_table[1]的内容为 -1 5 0 0 0 ... 0
	*/
	for (i = 1; i < N_POW; i++)
		calc_next(power_table[i], power_table[i + 1]); //已知2^-i，求2^-(i+1)

	//power_table经验证已经初始化好，是char数组，但存入的是正常de1-9，所以输出的时候要输出强转int
	// 就是加'0'
	//cout << (int)power_table[1];//我一开始这么写的，但这样输出的是地址，不是什么int型
	//

	for (int j = 1; j < 113; j++) {
		for (int k = 1; k < 114; k++) {
			power_table[j][k] += '0';
		}
	}//好的，到这步我转万了，直接输出char型即可

	/* 上标尺 */
	output_rod(1);

	/* 输出 */
	for (i = 1; i <= N_POW; i++)
		output(NULL, power_table[i]);
	//特别好，到这步已经顺利完成。没有问题

	/* 下标尺 */
	output_rod(0);
	cout << endl;

	/* 输入一个二进制纯小数 */
	char pure_decimal[N_NUM + 1] = { 0 };
	for (int i = 0; i < 114; i++) {
		pure_decimal[i] = 0;
	}
	input_pure_decimal(pure_decimal);
	int point = 0;//引入标记，防止输出多余的0，与demo不符
	for (int i = 0; i < 113; i++) {
		if (pure_decimal[i] == 0) {
			point = i;
			break;
		}
	}

	for (int m = point - 1; m >= 0; m--) {//point-1还卡了一会，不是point
		if (pure_decimal[m] == '0') {

			point = m;
			continue;
		}

		break;
	}


	//对point的位置调整完毕
	for (i = 111; i >= point; i--) {
		pure_decimal[i] = 0;

	}
	cout << endl;
	/* 上标尺 */
	output_rod(1);

	output("输入数据 : ", pure_decimal);
	char out[N_NUM + 1] = { 0 };//记得求证一下如果写'0'那里面会权初始化成‘0’还是仅第一个
	//目前以上已完成。无问题,应该是仅第一个

	calc_num(pure_decimal, out, power_table);
	for (int i = 0; i < 112; i++) {
		out[i] += '0';
	}
	out[point] = 0;
	output("计算值 : 0.", out);
	/* 下标尺 */
	output_rod(0);

	cout << endl;

	return 0;
}

/*
PPT例题的测试数据
.00110011001100110011010
*/
//目前已经基本完成，现在还有一个小问题是如果输入.1100，则输出会是1100,而demo是11
//我现在的想法是因为我之前的两个函数都是通过标记输出，所以说这次wo同样可以通过标记来调整标记前存在的0，或者说是调整标记本身